# VendorId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..VendorId Property
Schema Class See Also
---
The id of the third-party vendor that may access entities of this Schema under the Vendor access level.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string VendorId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VendorId As String
	Get
```

Visual C++
---
```text
public:
property String^ VendorId {
	String^ get ();
}
```

# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace